In [3]:
import pandas as pd

In [4]:
log = pd.read_csv('log.csv')

In [5]:
log.head()

,Запись пользователя № - user_919,[2019-01-01 14:06:51,Unnamed: 2,Unnamed: 3
0,Запись пользователя № - user_973,[2019-01-01 14:51:16,NaN,NaN
1,Запись пользователя № - user_903,[2019-01-01 16:31:16,NaN,NaN
2,Запись пользователя № - user_954,[2019-01-01 17:17:51,NaN,NaN
3,Запись пользователя № - user_954,[2019-01-01 21:31:18,NaN,NaN
4,Запись пользователя № - user_917,[2019-01-01 23:34:55,156789.0,NaN

In [6]:
log = pd.read_csv('log.csv', header=None)
log.head()

                                  0                     1   2   3
0  Запись пользователя № - user_919  [2019-01-01 14:06:51 NaN NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16 NaN NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16 NaN NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51 NaN NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18 NaN NaN

Загрузите файл sample.csv в переменную sample, сохраните колонки в переменную columns:

In [7]:
sample = pd.read_csv('sample.csv')
columns = sample.columns

Создайте в sample заголовки колонок так, чтобы там были только маленькие буквы. Например, вместо 'Age' нужно сделать 'age':

In [8]:
sample = pd.read_csv('sample.csv')
sample.columns = [column.lower() for column in sample.columns]

In [9]:
sample = pd.read_csv('sample.csv')
sample.columns = list(map(lambda column: column.lower(),sample.columns))

Давайте применим полученные знания для нашего датафрейма: замените в log заголовки колонок на:
- user_id
- time
- bet
- win

In [10]:
log = pd.read_csv("log.csv", header=None)
log.columns = ['user_id','time','bet','win']

Давайте перейдем ко второму файлу users.csv. Его импортировали из старой версии Excel у системного администратора, и, по словам Коли, многие не смогли его открыть. Загрузите файл в переменную users. Не открывается сразу? Попробуйте открыть его в текстовом редакторе и разобраться, что с ним не так.

Посмотрите, какие параметры есть у функции read_csv: в чём может быть ошибка?

С помощью правильных параметров read_csv загрузите датафрейм:

In [11]:
# https://docs.python.org/2.4/lib/standard-encodings.html

In [12]:
users = pd.read_csv('users.csv',sep='\t', encoding = 'koi8_r')

In [13]:
users.head()

     Юзверь                 мейл        Гео
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

Прочитайте файл в переменную users. Замените в нём названия колонок на:
- user_id
- email
- geo

In [14]:
users = pd.read_csv('users.csv',sep='\t', encoding = 'koi8_r')
users.columns = ['user_id','email','geo']

In [15]:
users.head()

    user_id                email        geo
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

Очистка данных
Перейдём к очистке данных. На этом этапе нужно тщательно изучить сами данные, а именно:

формат представления данных,
ошибки в данных,
пропущенные значения,
дубликаты,
типы данных (числа, строки, даты).
Давайте посмотрим на качество данных. Насколько они валидны? Есть ли пропущенные значения? Есть ли проблема с форматом данных? Просмотрите данные: что вам удалось обнаружить?

Один из самых простых способов просмотреть данные — это воспользоваться функцией .unique(), которая выдаёт список уникальных значений колонки.

Посмотрите все уникальные значения в sample.csv.

Какие ошибки вы видете в колонке Name?

In [16]:
[sample[column] for column in sample.columns]

[0           Иванов
 1              NaN
 2           Иванов
 3          sidorov
 4          _______
 5         Кузнецов
 6            Сажин
 7     Котлеревский
 8       Завалишина
 9           Левина
 10            Фикс
 Name: name, dtype: object, 0          Москва
 1       Волгоград
 2          Москва
 3     Владивосток
 4           Курск
 5            Сочи
 6          Сургут
 7      Йошкар-Ола
 8       Чебоксары
 9             NaN
 10           Рига
 Name: city, dtype: object, 0     25
 1     31
 2     25
 3     43
 4     50
 5     19
 6     29
 7     32
 8     36
 9     55
 10    42
 Name: age, dtype: int64, 0       Клинер
 1     Менеджер
 2       Клинер
 3     Менеджер
 4     Водитель
 5      Рабочий
 6      Рабочий
 7      Рабочий
 8     Менеджер
 9      Рабочий
 10     Рабочий
 Name: profession, dtype: object]

Посмотрите, сколько непустых значений в колонке City.

In [17]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
name          10 non-null object
city          10 non-null object
age           11 non-null int64
profession    11 non-null object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

Поработаем с log.csv. В колонке user_id есть записи, которые содержат технические ошибки. Укажите, что записано в поле user_id в строчках с ошибкой:

In [18]:
log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

Потренируемся на sample.csv.

Создайте новый датафрейм sample2, в который будут входить только записи о людях в возрасте меньше 30 лет.

In [19]:
sample = pd.read_csv("sample.csv")
sample2 = sample[sample.Age < 30]

Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

In [20]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log_win = log[log.win.notna()]
win_count = log.win.count()

Создайте новый датафрейм sample2, в который будут входить только записи о рабочих младше 30 лет.

In [21]:
sample = pd.read_csv("sample.csv")
sample2 = sample[(sample.Age < 30) & (sample.Profession == 'Рабочий')]

Pandas помогает фильтровать значения без создания циклов, главное — сформулировать, что именно ты ищешь. Наиболее мощный и удобный способ проводить фильтрацию — использовать функцию query. Она позволяет писать сложные запросы к датафрейму. Если вы работали с SQL-запросами, то принцип работы query будет вам понятен.

Среди запросов может быть сравнение. В примере мы получаем все элементы, для которых возраст больше 20:

In [22]:
sample.query('Age>20')

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [23]:
sample.query('City in ["Рига","Сочи"]')

        Name  City  Age Profession
5   Кузнецов  Сочи   19    Рабочий
10      Фикс  Рига   42    Рабочий

In [24]:
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] &                     \
             21<Age<50 & Profession!="Менеджер"')

     Name    City  Age Profession
6   Сажин  Сургут   29    Рабочий
10   Фикс    Рига   42    Рабочий

С помощью функции query найдите тех, у кого ставка меньше 2000, а выигрыш больше 0. Сохраните в новый датафрейм log2.

In [25]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log2 = log.query('bet < 2000 & win > 0')

Функции str.match и str.contains  
Часто приходится фильтровать значения в столбце по соответствию строке или её части. Для этого есть две полезные функции:

str.match ("abc") — ищет строки, которые начинаются c abc,  
str.contains ("abc") — ищет строки, в которых есть abc.  
Обе функции не могут работать с NaN, необходимо использовать параметр na = False:

In [27]:
sample[sample.Name.str.match("К", na=False)]

           Name        City  Age Profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [28]:
sample[~sample.Name.str.match("К", na=False)]

          Name         City  Age Profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

Найдите записи, где в городах есть буква «о», и сохраните в переменную sample3.

Функция contains не может работать с пустыми значениями: необходимо использовать параметр na = False

In [29]:
sample = pd.read_csv("sample.csv")
sample3 = sample[sample.City.str.contains('о', na=False)]

Найдите записи, где в городах нет буквы "о", и сохраните в переменную sample4. Не забудьте про NaN и параметр na:

In [30]:
sample = pd.read_csv("sample.csv")
sample4 = sample[~sample.City.str.contains('о', na=False)]

In [31]:
sample4

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

Сохраните в переменную new_log датафрейм, из которого удалены записи с ошибкой в поле user_id:

In [32]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
new_log = log[~log.user_id.str.contains('error', na = False)]

In [33]:
new_log

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

Часто данные оказываются плохо приспособленными к анализу, поэтому их следует преобразовать. Для решения этой задачи используется функция apply.  

df.column_name.apply(func)
Apply вызывает свою функцию для каждого элемента колонки. Функции, с которыми работает apply, бывают двух видов:

лямбда-функции (можно задать внутри apply),
обычные именные функции (определяются через def).
Возведём возраст в sample в квадрат:

sample.Age.apply(lambda x:x**2)

С помощью apply и лямбда-функции увеличьте возраст во всех записях на 1 год и сохраните в sample2:

In [138]:
sample = pd.read_csv("sample.csv")
sample2 = sample.apply(lambda x: x + pd.Series(['','',1,''] ,sample.columns), axis=1)

In [137]:
sample = pd.read_csv("sample.csv")
sample3 = sample.copy()
sample3.Age = sample.Age.apply(lambda x: x+1)

In [175]:
sample = pd.read_csv("sample.csv")
sample2 = sample.apply(lambda x:  x+1 if x.name == 'Age' else x)

С помощью apply и lambda-функции замените все буквы в поле City на маленькие и сохраните в sample2. Вам может понадобиться функция s.lower().

Обратите внимание: когда в столбце есть пропущенные значения, необходимо в явном виде указывать, что это str.

In [192]:
sample = pd.read_csv("sample.csv")
sample2 = sample.apply(lambda x: x.apply(lambda xx :str(xx).lower()) if x.name == 'City' else x)

In [194]:
sample = pd.read_csv("sample.csv")
sample3 = sample.copy()
sample3.City = sample.City.apply(lambda x :str(x).lower())

Напишите функцию profession_code, которая на вход получает строку, а на выход возвращает:
- 0 — если на вход поступила строка "Рабочий"
- 1 — если на вход поступила строка "Менеджер"
- 2 — в любом другом случае

In [198]:
def profession_code(s):
    if s == "Рабочий": return 0
    elif s == "Менеджер": return 1
    else: return 2

Примените функцию profession_code для того, чтобы заменить поле Profession с помощью apply. Сохраните получившийся датафрейм в переменную sample2.

Функцию необходимо определить повторно!

In [206]:
sample = pd.read_csv("sample.csv")
sample2 = sample.copy()
sample2.Profession= sample2.Profession.apply(profession_code)

Напишите функцию age_category, которая на вход получает число, а на выход отдаёт:

- "молодой" — если возраст меньше 23
- "средний" — если возраст от 23 до 35
- "зрелый" — если возраст больше 35

In [207]:
def age_category(age):
    if age < 23: return 'молодой'
    elif age < 35: return 'средний'
    else: return 'зрелый'

Примените функцию age_category и apply, чтобы создать новую колонку в sample под названием 'Age_category'. Не забудьте загрузить датафрейм.

Вспомним, как создать новую колонку:

df['new_column'] = df.old_column.apply(func)

In [209]:
def age_category(age):
    if age < 23: return 'молодой'
    elif age < 35: return 'средний'
    else: return 'зрелый'

sample = pd.read_csv("sample.csv")
sample['Age_category'] = sample.Age.apply(age_category)

Преобразуем поле user_id в датафрейме log, оставив только идентификатор пользователя. Например, вместо "Запись пользователя № — user_974" должно остаться только "user_974".

На месте записей с ошибками в user_id должна быть пустая строка "". Сделайте это через apply и новую функцию, которую вы создадите. Результат сохраните в log:

In [222]:
log = pd.read_csv('log.csv', header=None)
log.columns = ['user_id','time','bet','win']

def user_id_clearing(old_rec):
    if old_rec == '#error': return ''
    else: return old_rec[old_rec.find('user'):]
    
log.user_id = log.user_id.apply(user_id_clearing)

In [ ]:
# lambda x: x[x.find('user'):]

Загрузите log.csv в log. Удалите квадратную скобку из первой строки в столбце time, чтобы привести его к более привычному формату: t равен log.time[0]. Сохраните результат в t:

In [239]:
log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
t = log.time[0]
t = t[1:]

Уберите ненужную скобку "[" из поля в time. Результат сохраните в log:

In [251]:
log = pd.read_csv('log.csv', header=None)
log.columns = ['user_id','time','bet','win']
log.time = log.time.apply(lambda x: x[1:] if x==x else x)

In [245]:
#def correct_time (incorrect_time):
#    if incorrect_time == incorrect_time: return incorrect_time[1:]
#    else: return incorrect_time

                              user_id                 time      bet      win
0    Запись пользователя № - user_919  2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  2019-01-01 21:31:18      NaN      NaN
..                                ...                  ...      ...      ...
995  Запись пользователя № - user_984   2019-04-20 9:59:58   9754.0      NaN
996                            #error                  NaN  10054.0  29265.0
997                            #error                  NaN  10454.0      NaN
998                            #error                  NaN   1000.0      NaN
999                            #error                  NaN  10754.0      NaN

[1000 rows x 4 columns]

In [246]:
#math.isnan(x)
#numpy.isnan(number)

Соединим всё, что мы делали, и очистим файл log.csv. А именно:

прочитаем файл в переменную log;  
добавим названия колонок user_id, time, bet, win;  
удалим строки, которые содержат значения user_id с ошибками;  
оставим в user_id только значения идентификатора;  
уберём начальную скобку из поля time.

In [272]:
log = pd.read_csv('log.csv', header=None)
log.columns = ['user_id','time','bet','win']
log.drop(index=log[log.user_id == '#error'].index, inplace= True)
log.user_id = log.user_id.apply(lambda x: x[x.find('user'):] )
log.time = log.time.apply(lambda x: x[1:] if x==x else x)

In [273]:
log

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]